---
title: FabricWireType
classe: Autodesk.Revit.DB.Structure.FabricWireType
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# FabricWireType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BendDiameter { get; set; }` | `fabricWireType.BendDiameter` | Double |
| `Double WireDiameter { get; set; }` | `fabricWireType.WireDiameter` | Double |
| `ElementId CreateDefaultFabricWireType(Document)` | `FabricWireType.CreateDefaultFabricWireType(ADoc)` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```